HirokiIshiguro/rx-driver-package/source/r_rsci_iic_rx/r_rsci_iic_rx_vx.xx/r_rsci_iic_rx/src/targets/rx660/r_rsci_iic_rx660.c
/***********************************************************************************************************************
 * Function Name: rsci_iic_set_frequency
 * Description  : Set IIC Frequency Processing.
 *                Sets SMR,BRR registers.
 * Arguments    : rsci_iic_info_t * p_rsci_iic_info   ;   IIC Information
 * Return Value : RSCI_IIC_SUCCESS                    ; Successful operation
 *              : RSCI_IIC_ERR_INVALID_ARG            ; Parameter error
 **********************************************************************************************************************/
static rsci_iic_return_t rsci_iic_set_frequency(rsci_iic_info_t * p_rsci_iic_info)
{
    volatile uint16_t brr_n     = 32U; /* default: 64*2^(2*0-1) = 32 */
    volatile uint8_t  cks_value = 0U; /* default: PCLK/1 */
    volatile uint32_t brr_value = 0U;

    uint32_t pclk;
    uint16_t brr_n_tmp;
    uint8_t  cks_value_tmp;

    rsci_regs_t pregs = g_rsci_iic_handles[p_rsci_iic_info->ch_no]->prom->regs;

    R_BSP_VOLATILE_EVENACCESS const rsci_iic_ch_rom_t * p_rom = g_rsci_iic_handles[p_rsci_iic_info->ch_no]->prom;

    pclk = BSP_PCLKA_HZ;

    /*  ---- Calculation BRR ---- */
    /* Macro definition does not have the type of declaration. The cast for the calculation of the floating point, 
     has been cast in the double type. After that, it is cast to type long to fit on the left-hand side. 
     Calculation results are not affected by casting, it is no problem. */
    brr_n_tmp = brr_n;

    /* Cast to double */
    brr_value = (uint32_t)((double)((double)((double)pclk / (brr_n_tmp *(p_rom->bitrate)))) - 1);

    /* Set clock source */
    /* WAIT_LOOP */
    while (brr_value > 255)
    {
        /* Counter over 0xff */
        switch (brr_n)
        {
            case 32 :
                brr_n     = 128; /* 64*(2^(2*1-1)) */
                cks_value = 1; /* clock select: PCLK/4 */
                break;

            case 128 :
                brr_n     = 512; /* 64*(2^(2*2-1))  */
                cks_value = 2; /* clock select: PCLK/16 */
                break;

            case 512 :
                brr_n     = 2048; /* 64*(2^(2*3-1)) */
                cks_value = 3; /* clock select: PCLK/64 */
                break;

            default :

                /* nothing to do */
                break;
        }

        /*  ---- Calculation BRR ---- */
        /* Macro definition does not have the type of declaration. The cast for the calculation of the floating point, 
         has been cast in the double type. After that, it is cast to type long to fit on the left-hand side. 
         Calculation results are not affected by casting, it is no problem. */
        brr_n_tmp = brr_n;

        /* Cast to double */
        brr_value = (uint32_t) ((double)(((double)pclk / (brr_n_tmp *(p_rom->bitrate)))) - 1);

        /* When the clock source of the on-chip baud rate generator is PCLK/64 and when the value
         of brr_value is greater than 255. */
        if ((3 == cks_value) && (255 < brr_value))
        {
            brr_value = 255;
        }
    }

    cks_value_tmp             = cks_value;
    pregs->SCR2.BIT.CKS       = cks_value_tmp; /* Sets SMR */
    pregs->SCR2.BIT.BRR       = brr_value; /* Sets BRR */

    return RSCI_IIC_SUCCESS;

} /* End of function rsci_iic_set_frequency() */

/***********************************************************************************************************************
 * Function Name: r_rsci_iic_mpc_setting
 * Description  : Set RSCI_IIC multi-function pin controller.
 * Arguments    : uint8_t port_gr      ;   port group
 *                uint8_t pin_num      ;   pin number
 *                uint8_t set_value    ;   value of pin function select setting
 * Return Value : None
 **********************************************************************************************************************/
void r_rsci_iic_mpc_setting(uint8_t port_gr, uint8_t pin_num, uint8_t set_value)
{
    R_BSP_VOLATILE_EVENACCESS uint8_t * const p_pmr = \
            (uint8_t *)((uint32_t)RSCI_IIC_PRV_PMR_BASE_REG+(uint32_t)port_gr); /* Get p_pmr */

    R_BSP_VOLATILE_EVENACCESS uint8_t * const p_pfs = \
            (uint8_t *)((uint32_t)RSCI_IIC_PRV_PFS_BASE_REG+(uint32_t)((port_gr*8)+pin_num)); /* Get p_pfs */

    if ((*p_pfs) != set_value)
    {
        (*p_pmr) &= (~(1U << pin_num)); /* Uses as a GPIO (Input port). */
        R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_MPC); /* Enables the PFS register writing. */
        (*p_pfs) = set_value; /* Pin function select to "SSCL/SSDA" or "Hi-Z" pin. */
        R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_MPC); /* Disables the PFS register writing. */

        /* Verifies "set_value" (setting value for the PFS register). */
        /* If "set_value" is a value other than 0 (default), sets the pin mode control bit to be used 
         as I/O port for peripheral functions. */
        if (RSCI_IIC_MPC_SSCL_INIT != set_value)
        {
            (*p_pmr) |= (1U << pin_num); /* Uses as RSCI_IIC (SSCL/SSDA). */
        }

        /* dummy read */
        if (*p_pmr)
        {
            R_BSP_NOP();
        }
    }
} /* End of function r_rsci_iic_mpc_setting() */

/***********************************************************************************************************************
 * Function Name: rsci_iic_clear_ir_flag
 * Description  : Clears Interrupt Request Flag Processing.
 *                Clears interrupt request register.
 * Arguments    : rsci_iic_info_t * p_rsci_iic_info     ;   IIC Information
 * Return Value : None
 **********************************************************************************************************************/
static void rsci_iic_clear_ir_flag(rsci_iic_info_t * p_rsci_iic_info)
{
    rsci_regs_t pregs = g_rsci_iic_handles[p_rsci_iic_info->ch_no]->prom->regs;

    R_BSP_VOLATILE_EVENACCESS const rsci_iic_ch_rom_t * p_rom = g_rsci_iic_handles[p_rsci_iic_info->ch_no]->prom;

    /* Checks IR flag. */
    /* If IR flag is set, clears IR flag. */

