HirokiIshiguro/rx-driver-package/source/r_rsci_iic_rx/r_rsci_iic_rx_vx.xx/r_rsci_iic_rx/src/targets/rx660/r_rsci_iic_rx660.c
    if (RSCI_IIC_IR_SET == (*p_rom->pir_txi))
    {
        /* Initializes ICIER->SCR0 register. */
        pregs->SCR0.LONG = RSCI_IIC_SCR0_INIT;

        /* WAIT_LOOP */
        while (RSCI_IIC_SCR0_INIT != pregs->SCR0.LONG)
        {
            /* nothing to do */
            R_BSP_NOP();
        }

        /* Clears TXI interrupt request register. */
        (*p_rom->pir_txi) = RSCI_IIC_IR_CLR;

        /* dummy read */
        if (*p_rom->pir_txi)
        {
            R_BSP_NOP();
        }
    }
} /* End of function rsci_iic_clear_ir_flag() */

    #if RSCI_IIC_CFG_CH10_INCLUDED
/***********************************************************************************************************************
 * Function Name: rsci_iic_int_rsci_iic10_txi_isr
 * Description  : Interrupt TXI handler for channel 10.
 *                Types of interrupt requests transmission end.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
R_BSP_PRAGMA_STATIC_INTERRUPT (rsci_iic_int_rsci_iic10_txi_isr, VECT_RSCI10_TXI)
R_BSP_ATTRIB_STATIC_INTERRUPT void rsci_iic_int_rsci_iic10_txi_isr(void)
{
    r_rsci_iic_txi_isr_processing(RSCI_IIC_NUM_CH10);

    /* Calls advance function */
    r_rsci_iic_advance(g_rsci_iic_handles[RSCI_IIC_NUM_CH10]->prsci_iic_info_ch);
} /* End of function rsci_iic_int_rsci_iic10_txi_isr() */
    #endif

    #if RSCI_IIC_CFG_CH11_INCLUDED
/***********************************************************************************************************************
 * Function Name: rsci_iic_int_rsci_iic11_txi_isr
 * Description  : Interrupt TXI handler for channel 11.
 *                Types of interrupt requests transmission end.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
R_BSP_PRAGMA_STATIC_INTERRUPT (rsci_iic_int_rsci_iic11_txi_isr, VECT_RSCI11_TXI)
R_BSP_ATTRIB_STATIC_INTERRUPT void rsci_iic_int_rsci_iic11_txi_isr(void)
{
    r_rsci_iic_txi_isr_processing(RSCI_IIC_NUM_CH11);

    /* Calls advance function */
    r_rsci_iic_advance(g_rsci_iic_handles[RSCI_IIC_NUM_CH11]->prsci_iic_info_ch);
} /* End of function rsci_iic_int_rsci_iic11_txi_isr() */
    #endif

    #if RSCI_IIC_CFG_CH10_INCLUDED
/***********************************************************************************************************************
 * Function Name: rsci_iic_int_rsci_iic10_tei_isr
 * Description  : Interrupt TEI handler for channel 10.
 *                Types of interrupt requests transfer error or event generation.
 *              : The event generations are arbitration-lost, NACK detection, timeout detection, 
 *              : start condition detection, and stop condition detection.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
void rsci_iic_int_rsci_iic10_tei_isr(void)
{
    r_rsci_iic_tei_isr_processing(RSCI_IIC_NUM_CH10);

    /* Calls advance function */
    r_rsci_iic_advance(g_rsci_iic_handles[RSCI_IIC_NUM_CH10]->prsci_iic_info_ch);
} /* End of function rsci_iic_int_rsci_iic10_tei_isr() */
    #endif

    #if RSCI_IIC_CFG_CH11_INCLUDED
/***********************************************************************************************************************
 * Function Name: rsci_iic_int_rsci_iic11_tei_isr
 * Description  : Interrupt TEI handler for channel 11.
 *                Types of interrupt requests transfer error or event generation.
 *              : The event generations are arbitration-lost, NACK detection, timeout detection, 
 *              : start condition detection, and stop condition detection.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
void rsci_iic_int_rsci_iic11_tei_isr(void)
{
    r_rsci_iic_tei_isr_processing(RSCI_IIC_NUM_CH11);

    /* Calls advance function */
    r_rsci_iic_advance(g_rsci_iic_handles[RSCI_IIC_NUM_CH11]->prsci_iic_info_ch);
} /* End of function rsci_iic_int_rsci_iic11_tei_isr() */
    #endif

#endif /* BSP_MCU_RX660 */

